GabrrielGSB/Micro-Libraries/ESP32-lib/__Internos/ADC/ADC.cpp
// ADC.cpp
#include "ADC.hpp"
#include "esp_log.h"
#include <string.h> // Necessário para manipulação de memória (malloc/free) no DMA
#include <math.h>   // Necessário para a função sqrt() do cálculo RMS
#include "sdkconfig.h"

adc_oneshot_unit_handle_t ADC::handle_unidade_adc1 = NULL;
adc_oneshot_unit_handle_t ADC::handle_unidade_adc2 = NULL;

ADC::ADC(gpio_num_t numPino, adc_atten_t atenuacao_db) : GPIO(numPino, INPUT) {
    atenuacao         = atenuacao_db;
    calibrado         = false;
    handle_calibracao = NULL;
    oneshot_inicializado = false; // <--- Controle do One-Shot
    
    modo_continuo_ativo = false;
    handle_continuo     = NULL;
    tamanho_buffer      = 0;

    ESP_ERROR_CHECK(adc_oneshot_io_to_channel(pino, &unidade, &canal));
}

// ==========================================
#pragma region MÉTODOS: MODO ONE-SHOT
    // Esta função liga o hardware simples APENAS se você tentar usar o ler()
    void ADC::inicializar_oneshot() {
        if (oneshot_inicializado || modo_continuo_ativo) return;

        if (unidade == ADC_UNIT_1 && handle_unidade_adc1 == NULL) {
            adc_oneshot_unit_init_cfg_t init_config1 = {}; 
            init_config1.unit_id = ADC_UNIT_1;
            ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &handle_unidade_adc1));
        } 
        else if (unidade == ADC_UNIT_2 && handle_unidade_adc2 == NULL) {
            adc_oneshot_unit_init_cfg_t init_config2 = {}; 
            init_config2.unit_id = ADC_UNIT_2;
            ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config2, &handle_unidade_adc2));
        }

        adc_oneshot_chan_cfg_t config_canal = {};
        config_canal.atten    = atenuacao;
        config_canal.bitwidth = ADC_BITWIDTH_DEFAULT; 

        adc_oneshot_unit_handle_t handle_ativo = (unidade == ADC_UNIT_1) ? handle_unidade_adc1 : handle_unidade_adc2;
        ESP_ERROR_CHECK(adc_oneshot_config_channel(handle_ativo, canal, &config_canal));

        inicializar_calibracao();
        oneshot_inicializado = true;
    }

    void ADC::inicializar_calibracao() {
        // Tenta usar Curve Fitting (Mais preciso, suportado no ESP32-S2, S3, C3, etc)
        #if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
            adc_cali_curve_fitting_config_t cali_config_curve = {};
            cali_config_curve.unit_id  = unidade;
            cali_config_curve.atten    = atenuacao;
            cali_config_curve.bitwidth = ADC_BITWIDTH_DEFAULT;
            
            if (adc_cali_create_scheme_curve_fitting(&cali_config_curve, &handle_calibracao) == ESP_OK) {
                calibrado = true;
                return;
            }
        #endif

        // Tenta usar Line Fitting (Suportado no ESP32 clássico)
        #if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
            adc_cali_line_fitting_config_t cali_config_line = {};
            cali_config_line.unit_id  = unidade;
            cali_config_line.atten    = atenuacao;
            cali_config_line.bitwidth = ADC_BITWIDTH_DEFAULT;
            cali_config_line.default_vref = 0; // 0 instrui a ESP-IDF a buscar o valor padrão de fábrica no eFuse
            
            if (adc_cali_create_scheme_line_fitting(&cali_config_line, &handle_calibracao) == ESP_OK) {
                calibrado = true;
                return;
            }
        #endif
    }

    int ADC::ler() {
        if (modo_continuo_ativo) return -1;

        inicializar_oneshot();

        int valor_bruto = 0;
        adc_oneshot_unit_handle_t handle_ativo = (unidade == ADC_UNIT_1) ? handle_unidade_adc1 : handle_unidade_adc2;

        adc_oneshot_read(handle_ativo, canal, &valor_bruto);
        return valor_bruto;
    }

    int ADC::ler_mV() {
    int valor_bruto = ler();
    if (valor_bruto == -1) return -1; 

    int voltagem_mV = 0;

    if (calibrado) {
        adc_cali_raw_to_voltage(handle_calibracao, valor_bruto, &voltagem_mV);
        return voltagem_mV;
    } 
    
    return valor_bruto; 
}
#pragma endregion
// ==========================================

// ==========================================
#pragma region MÉTODOS: MODO CONTÍNUO
    void ADC::configLeituraContinua(uint32_t amostragem_hz, uint32_t tamanho_buf) {
        if (oneshot_inicializado) {
            ESP_LOGE("ADC", "ERRO FATAL: O hardware ja foi bloqueado pelo modo de leitura simples. Nao use ler() junto com comecarLeitura().");
            return;
        }
        
        tamanho_buffer = tamanho_buf;

        // Configura o Handle principal do modo contínuo
        adc_continuous_handle_cfg_t config_handle = {};
        config_handle.max_store_buf_size = tamanho_buffer * 4; 
        config_handle.conv_frame_size    = tamanho_buffer;        

        ESP_ERROR_CHECK(adc_continuous_new_handle(&config_handle, &handle_continuo));

        adc_digi_pattern_config_t padrao_adc = {};
        padrao_adc.atten     = atenuacao;
        padrao_adc.channel   = canal;
        padrao_adc.unit      = unidade;
        // CORREÇÃO 1: O DMA exige o tamanho exato de bits nativo da placa
        padrao_adc.bit_width = SOC_ADC_DIGI_MAX_BITWIDTH; 

        adc_continuous_config_t config_continuo = {};
        config_continuo.sample_freq_hz = amostragem_hz;
        config_continuo.conv_mode      = (unidade == ADC_UNIT_1) ? ADC_CONV_SINGLE_UNIT_1 : ADC_CONV_SINGLE_UNIT_2;
        config_continuo.pattern_num    = 1;
        config_continuo.adc_pattern    = &padrao_adc;

        // CORREÇÃO 2: Adaptação automática do formato de dados dependendo do seu modelo de ESP32
        #if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
            config_continuo.format = ADC_DIGI_OUTPUT_FORMAT_TYPE1;
        #else
            // S3, C3, C6 utilizam obrigatoriamente o TYPE2
            config_continuo.format = ADC_DIGI_OUTPUT_FORMAT_TYPE2; 
        #endif

        ESP_ERROR_CHECK(adc_continuous_config(handle_continuo, &config_continuo));
        
        modo_continuo_ativo = true; 
    }

    void ADC::comecarLeitura(uint32_t amostragem_hz, uint32_t tamanho_buf) {
        configLeituraContinua(amostragem_hz, tamanho_buf);

        if (modo_continuo_ativo && handle_continuo != NULL) {
            ESP_ERROR_CHECK(adc_continuous_start(handle_continuo));
        }
    }

    void ADC::pararLeitura() {
        if (modo_continuo_ativo && handle_continuo != NULL) {
            ESP_ERROR_CHECK(adc_continuous_stop(handle_continuo));
        }
    }

    EstatisticaADC ADC::lerLeituras() {
        EstatisticaADC estatistica = {4095, 0, 0.0f, 0}; 
        if (!modo_continuo_ativo) return estatistica;
        
        uint8_t* dados_dma = (uint8_t*)malloc(tamanho_buffer);
        if (dados_dma == NULL) return estatistica;

        uint32_t tamanho_retornado = 0;
        
        // Espera até 1000ms para o buffer encher
        esp_err_t erro = adc_continuous_read(handle_continuo, dados_dma, tamanho_buffer, &tamanho_retornado, 1000);

        if (erro == ESP_OK && tamanho_retornado > 0) {
            
            // ... (AQUI CONTINUA O SEU LAÇO FOR NORMAL COM A MATEMÁTICA) ...
            uint64_t soma_quadrados = 0;
            uint32_t valor_maximo = 0;
            uint32_t valor_minimo = 4095;
            int quantidade_amostras = 0;

            for (int i = 0; i < tamanho_retornado; i += SOC_ADC_DIGI_RESULT_BYTES) {
                adc_digi_output_data_t *dado = (adc_digi_output_data_t*)&dados_dma[i];
                uint32_t valor_cru = 0;

                #if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
                    valor_cru = dado->type1.data;
                #else
                    valor_cru = dado->type2.data;
                #endif

                if (valor_cru > 4095) continue;

                if (valor_cru > valor_maximo) valor_maximo = valor_cru;
                if (valor_cru < valor_minimo) valor_minimo = valor_cru;

                soma_quadrados += (valor_cru * valor_cru);
                quantidade_amostras++;
            }

            if (quantidade_amostras > 0) {
                estatistica.minimo = valor_minimo;
                estatistica.maximo = valor_maximo;
                float media_quadrados = (float)soma_quadrados / quantidade_amostras;
                estatistica.rms = sqrt(media_quadrados);
                estatistica.amostras_lidas = quantidade_amostras;
            }
        } 
        // 👇 NOVIDADE AQUI: Captura e exibe erros silenciosos!
        else if (erro == ESP_ERR_INVALID_STATE) {
            printf("[ADC AVISO] Buffer transbordou! O loop do processador principal está lento demais.\n");
        } else if (erro == ESP_ERR_TIMEOUT) {
            printf("[ADC AVISO] Timeout. Nenhum dado chegou do hardware.\n");
        }

        free(dados_dma); 
        return estatistica;
    }
#pragma endregion
// ==========================================

// ==========================================
#pragma region DESTRUTOR
    ADC::~ADC() {
        if (calibrado) {
            #if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
                adc_cali_delete_scheme_curve_fitting(handle_calibracao);
            #elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
                adc_cali_delete_scheme_line_fitting(handle_calibracao);
            #endif
        }

        if (modo_continuo_ativo && handle_continuo != NULL) {
            pararLeitura();
            adc_continuous_deinit(handle_continuo);
        }
    }
#pragma endregion
// ==========================================